other pandas data structure

what is a DataFrame?

CREATION OF DATAFRAMES:

USING:
LISTS
NUMPY ARRAY
DICTIONARY
SERIES

In [ ]:
# lets create a DataFrame(pandas ds) using python ds

syntax: pd.DataFrame(data,index,columns)

In [ ]:
# libraries
import pandas as pd
import numpy as np

In [ ]:
# using lists
df1 = pd.DataFrame([[1,'roi',78],[2,'smily',45],[3,'juhee',90]])
df1

   0      1   2
0  1    roi  78
1  2  smily  45
2  3  juhee  90

In [ ]:
# /with index and columns
list1 = [[1,'roi',78],[2,'smily',45],[3,'juhee',90]]
df1 = pd.DataFrame(data = list1,index=['a','b','c'],columns=['id','name','marks'])
df1

   id   name  marks
a   1    roi     78
b   2  smily     45
c   3  juhee     90

In [ ]:
# using np array
df1 = pd.DataFrame(np.array([[1,'roi',78],[2,'smily',45],[3,'juhee',90]]))
df1

   0      1   2
0  1    roi  78
1  2  smily  45
2  3  juhee  90

In [ ]:
# using dictionary
dict1 = {'id':[1,2,3],'name':['riya','julie','marie'],'marks':[78,45,90]}
df1 = pd.DataFrame(data = dict1,index=['a','b','c'],columns=['id','name','marks'])
df1

   id   name  marks
a   1   riya     78
b   2  julie     45
c   3  marie     90

In [ ]:
# using pd series
df2 = pd.DataFrame({'name':pd.Series(['riya','julie','marie']),'marks':pd.Series([78,45,90]),'age':pd.Series([12,16])})
df2

    name  marks   age
0   riya     78  12.0
1  julie     45  16.0
2  marie     90   NaN

important functions

*   head()
*   tail()
*   set_index()
*   unique
*   index
*   column
*   drop()
*   dtype

In [ ]:
df2 = pd.DataFrame({'name':pd.Series(['riya','julie','marie','sandy','garim']),'marks':pd.Series([78,45,90,88,65]),'age':pd.Series([12,16,17,15,16])})
df2

    name  marks  age
0   riya     78   12
1  julie     45   16
2  marie     90   17
3  sandy     88   15
4  garim     65   16

In [ ]:
df2.head(2)

    name  marks  age
0   riya     78   12
1  julie     45   16

In [ ]:
df2.tail(2)

    name  marks  age
3  sandy     88   15
4  garim     65   16

In [ ]:
# .dtype function
df2.name.dtype

dtype('O')

1) head()

2) tail()

3) dtype

4) columns

5) nunique()

6) info()

7) isnull()

8) shape

9) dropna()

10)drop()

In [ ]:
# set_index()

arithmetic operations:

In [ ]:
d


*